#ifndef Tasklist_H
#define Tasklist_H


#include "main.h"
#include "usbd_cdc_if.h"
#include "stdio.h"
#include "DPPTM.h"


/*定义参数结构体***********************************************************************************************************/

//接收数据结构体
typedef struct 
{
    uint8_t GetCDCDateBuffer[64];             //接收数据数据；受硬件限制最大为64个字节
    uint8_t GetCDCDateLen;                    //记录接收数组的长度
    uint8_t GetCDCDateFlag;                   //数据处理标志位；0：可以有新的数据放进数组；1：数组中数组还没有处理完
}GetCDCDate_t;

//任务列表结构体
typedef struct 
{
    uint8_t AdjustVDD;                        //调整ESL模组使用的VDD
}Tasklist_t;

/*定义参数结构体***********************************************************************************************************/




/*变量声明***********************************************************************************************************/

extern GetCDCDate_t GetCDCDate;

/*变量声明***********************************************************************************************************/




/*函数声明***********************************************************************************************************/

void TaskRun(void);

/*函数声明***********************************************************************************************************/





#endif